## Plans :heavy_check_mark:

<details>
  <summary><h2>Terrateam Plan Output :heavy_check_mark:</h2></summary>

**Dir**: .
**Workspace**: default
**Success**: :heavy_check_mark:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_target.this["fargate_spot"] will be created
+   resource "aws_cloudwatch_event_target" "this" {
+       arn            = "arn:aws:batch:us-east-1:376942697097:job-queue/fargate_spot"
+       event_bus_name = "default"
+       id             = (known after apply)
+       role_arn       = (known after apply)
+       rule           = "batch-rule"
+       target_id      = (known after apply)

+       batch_target {
+           job_definition = "arn:aws:batch:us-east-1:376942697097:job-definition/example-scheduled-jobs:1"
+           job_name       = "example-scheduled-jobs"
        }
    }

  # module.example_aws.module.eventbridge.aws_iam_role.eventbridge[0] must be replaced
-/+ resource "aws_iam_role" "eventbridge" {
!       arn                   = "arn:aws:iam::376942697097:role/default" -> (known after apply)
!       create_date           = "2022-08-25T08:36:03Z" -> (known after apply)
!       id                    = "default" -> (known after apply)
!       managed_policy_arns   = [] -> (known after apply)
!       name                  = "default" -> "example-scheduled-jobs-eventbridge" # forces replacement
+       name_prefix           = (known after apply)
        tags                  = {
            "module" = "eventbridge"
        }
!       unique_id             = "AROAVPQ4JDKEQGHLWEFPX" -> (known after apply)
        # (5 unchanged attributes hidden)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 76.65 | 76.65 | 0.00|
| | **Total** | **76.65** | **76.65** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>

